In [33]:
# Ambientando um Alô mundo!

print("Aló mundo!")

Aló mundo!

SqlAlchemy é uma biblioteca de ORM

- Conexão fácil.
- Mapeamento de Tabela com Classe (ORM).
- Resolve um conflito de tecnologias com paradigmas diferentes.
- Tudo fique orientado a objetos.

In [34]:
! pip freeze > requeriments.txt

In [35]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (2.0.32)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [36]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [37]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\documents\rafael\semanadatascience\desafio\.venv\lib\site-packages (1.1.1)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [38]:
import pandas as pd

In [39]:
from sqlalchemy import create_engine

In [40]:
import pymysql

Senha?
- password: senai@123

In [41]:
#biblioteca para converter e resolver o problema do @
import urllib.parse

# Qual o usuario do banco e a senha?

user = 'root'
#user = 'datascience_manha'

password = urllib.parse.quote_plus('senai@123')
#password=''

# Qual o host e o banco?
host = 'localhost'
database= 'projetodiario1'

# connection_string: string com todas as informações da conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# criando a conexão
engine = create_engine(connection_string)

# Escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"

# Criar um dataframe com uma consulta SQL
df_alunos = pd.read_sql(query_alunos, engine)

df_alunos

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
0,1,12345670,None,0,NaN
1,2,12345671,None,0,NaN
2,3,12345672,None,0,NaN
3,4,12345673,None,0,NaN
4,5,12345674,None,0,NaN
...,...,...,...,...,...
70,71,52345725,Eliane Lima,65,6000.0
71,72,52345726,Felipe Santos,66,6100.0
72,73,52345727,Gabriela Costa,67,6200.0
73,74,52345728,Henrique Oliveira,68,6300.0
74,75,52345729,Igor Silva,69,6400.0

Bibliotecas para dataScience

- pandas(EDA - Analise Exploratória de Dados)
- Scikit-Learn (Fundamentos de inteligência Artificial)
- NumPy(Matemática Complexa com Abstração)

Salvando DataFrame

- .csv
- .xlsx
- .json
- .sql
- .html
- .xml

In [42]:
csv_filename = "alunos.csv"
df_alunos.to_csv(csv_filename,index=False)

# Crie uma nova célula que salve o dataframe no formato .JSON

In [43]:
json_filename = "aluno.json"
df_alunos.to_json(json_filename,index=False)

Um novo dataframe

In [44]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'Tempo_de_Estudo', 'Renda_Media_Salarial_Familiar'], dtype='object')

In [45]:
df_tempo_renda = df_alunos[['Tempo_de_Estudo','Renda_Media_Salarial_Familiar']]

In [46]:
type(df_tempo_renda)

pandas.core.frame.DataFrame

In [47]:
# Fatiar o vetor do 0 ao 29
df_alunos[0:30]

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
0,1,12345670,None,0,NaN
1,2,12345671,None,0,NaN
2,3,12345672,None,0,NaN
3,4,12345673,None,0,NaN
4,5,12345674,None,0,NaN
5,6,12345675,None,0,NaN
6,7,12345676,None,0,NaN
7,8,12345677,None,0,NaN
8,9,12345678,None,0,NaN
9,10,12345679,None,0,NaN
10,11,12345680,None,0,NaN
11,12,12345681,None,0,NaN
12,13,12345682,None,0,NaN
13,14,12345683,None,0,NaN
14,15,12345684,None,0,NaN
15,16,12345685,None,0,NaN
16,17,12345686,None,0,NaN
17,18,12345687,None,0,NaN
18,19,12345688,None,0,NaN
19,20,12345689,None,0,NaN
20,21,12345690,None,0,NaN
21,22,12345691,None,0,NaN
22,23,12345692,None,0,NaN
23,24,12345693,None,0,NaN
24,25,12345694,None,0,NaN
25,26,52345680,Ana Silva,20,1500.0
26,27,52345681,Carlos Oliveira,25,2000.0
27,28,52345682,Fernanda Costa,30,2500.0
28,29,52345683,Gabriel Santos,22,1800.0
29,30,52345684,Juliana Lima,27,2200.0

In [48]:
# do 25 ao 29
df_alunos[25:30]

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
25,26,52345680,Ana Silva,20,1500.0
26,27,52345681,Carlos Oliveira,25,2000.0
27,28,52345682,Fernanda Costa,30,2500.0
28,29,52345683,Gabriel Santos,22,1800.0
29,30,52345684,Juliana Lima,27,2200.0

In [50]:
# Crie uma series só apenas com a renda familiar?

renda_familiar = df_alunos['Renda_Media_Salarial_Familiar']
type(renda_familiar)

pandas.core.series.Series

In [51]:
renda_familiar

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
       ...
70    6000.0
71    6100.0
72    6200.0
73    6300.0
74    6400.0
Name: Renda_Media_Salarial_Familiar, Length: 75, dtype: float64

# Funçoes básicas

1) Retorne as duas primeiras linhas de um dataFrame

In [52]:
df_alunos.head(2)

   id        ra  Nome  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0   1  12345670  None                0                            NaN
1   2  12345671  None                0                            NaN

In [54]:
df_alunos[0:2]

   id        ra  Nome  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0   1  12345670  None                0                            NaN
1   2  12345671  None                0                            NaN

In [58]:
df_alunos.iloc[0:2]

   id        ra  Nome  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0   1  12345670  None                0                            NaN
1   2  12345671  None                0                            NaN

2. Retorne as duas últimas linhas da amostra

In [59]:
df_alunos.tail(2)

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
73,74,52345728,Henrique Oliveira,68,6300.0
74,75,52345729,Igor Silva,69,6400.0

In [60]:
df_alunos[73:75]

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
73,74,52345728,Henrique Oliveira,68,6300.0
74,75,52345729,Igor Silva,69,6400.0

In [61]:
df_alunos.iloc[73:75]

,id,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
73,74,52345728,Henrique Oliveira,68,6300.0
74,75,52345729,Igor Silva,69,6400.0

In [62]:
df_alunos.iloc[-2]

id                                              74
ra                                        52345728
Nome                             Henrique Oliveira
Tempo_de_Estudo                                 68
Renda_Media_Salarial_Familiar               6300.0
Name: 73, dtype: object

3. Retorne uma tupla com número de linhas e colunas

In [63]:
df_alunos.shape

(75, 5)

In [65]:
# Só colunas
df_alunos.columns

Index(['id', 'ra', 'Nome', 'Tempo_de_Estudo', 'Renda_Media_Salarial_Familiar'], dtype='object')

In [66]:
# Retorna informações
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 5 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   id                             75 non-null     int64
 1   ra                             75 non-null     object
 2   Nome                           50 non-null     object
 3   Tempo_de_Estudo                75 non-null     int64
 4   Renda_Media_Salarial_Familiar  50 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.1+ KB

In [67]:
# Retorna informações estatisticas
df_alunos.describe()

              id  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
count  75.000000        75.000000                      50.000000
mean   38.000000        29.666667                    3956.000000
std    21.794495        24.222133                    1448.878525
min     1.000000         0.000000                    1500.000000
25%    19.500000         0.000000                    2725.000000
50%    38.000000        32.000000                    3950.000000
75%    56.500000        50.500000                    5175.000000
max    75.000000        69.000000                    6400.000000

# União

- concat ()
- merge ()

# Crie um novo DataFrame da tabela diariobordo do MySQL

In [77]:
# Escrever uma consulta SQL
query_diarios = "SELECT * FROM diariobordo"

# Criar um dataframe com uma consulta SQL
df_diarios = pd.read_sql(query_diarios, engine)

In [79]:
df_diarios

   id           texto            datahora  fk_aluno_id
0   1  Aula foi legal 2024-08-01 09:16:00            1

In [76]:
# Escrever uma consulta SQL
query_avaliacoes = "SELECT * FROM avaliacao"

# Criar um dataframe com uma consulta SQL
df_avaliacao = pd.read_sql(query_avaliacoes, engine)

df_avaliacao

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     20     24     20     23           24
1   2     22     23     22     22           23
2   3     23     22     24     20           22
3   4     24     21     21     24           21

In [82]:
resultado = pd.merge(df_diarios, df_alunos, how='left', left_on='fk_aluno_id', right_on='id')
resultado

,id_x,texto,datahora,fk_aluno_id,id_y,ra,Nome,Tempo_de_Estudo,Renda_Media_Salarial_Familiar
0,1,Aula foi legal,2024-08-01 09:16:00,1,1,12345670,None,0,NaN